package com.example.myapplicationplanets

object SetData { fun SetPlanets():List<PlanetData>{
    var Planetlist= mutableListOf<PlanetData>()
    Planetlist.add(
        PlanetData(
            1,
            "Mars",
            "Milkyway Galaxy",
            "მარსი მეოთხე პლანეტაა სიშორითა და მერკურის შემდეგ, ზომით ყველაზე მცირე პლანეტა მზის სისტემაში. მას რომაული ომის ღმერთის მარსის სახელი ჰქვია (არესი ბერძნულ მითოლოგიაში). მარსს მეტსახელად ”წითელ პლანეტასაც” უწოდებენ, მისი ზედაპირის მოწითალო შეფერილობის გამო, რაც მაგემიტის (რკინის ოქსიდის) დიდი რაოდენობითაა გამოწვეული.\n" +
                    "\n" +
                    "მარსი დედამიწის ჯგუფის პლანეტებს მიეკუთვნება, მისი ატმოსფერო გაიშვიათებულია (დედამიწასთან შედარებით წნევა მარსის ზედაპირზე 160-ჯერ მცირეა). პლანეტის რელიეფის თავისებურებას წარმოადგენს: მთვარის მსგავსი კრატერები (ისინი მეტეორიტებთან შეჯახებითაა გამოწვეული), ვულკანები, უდაბნოები, ხეობები და დედამიწის მსგავსი პოლარული ყინულის ქუდები."
        )
    )
    Planetlist.add(
        PlanetData(
            2,
            "Moon",
            "Milkyway Galaxy",
            "მთვარე დედამიწის ერთადერთი ბუნებრივი თანამგზავრია. მზის სისტემის ერთ-ერთი უდიდესი ბუნებრივი თანამგზავრი, და უდიდესი თანამგზავრებს შორის ზომის შეფარდებით იმ პლანეტასთან, რომლის გარშემოც ისინი ბრუნავენ. აგრეთვე, დღეს ცნობილი თანამგზავრების სიმკვრივეებს შორის, ის ამ მაჩვენებლით მეორეა (იუპიტერის თანამგზავრ იოს შემდეგ). მას რაიმე ფორმალური სახელი გარდა მთვარისა არ გააჩნია, თუმცა ზოგადად მეცნიერულ შრომებში მას „ლუნა“-დაც (ზედს. ლუნარული) მოიხსენიებენ (ლათ. Luna). მისი სიმბოლოა ნახევარმთვარე. მთვარის საშუალო სიშორე დედამიწიდან 384 000კმ-ია. პერიგეუმში მანძილი 363 104 კმ -ია და აპოგეუმში 405 696 კმ. დიამეტრი 3 476 კმ-ია.\n" +
                    "\n" +
                    "მთვარე ბნელი და ცივი, „ბრმა“ ციური სხეულია, რომელიც მზისგან არეკლილი სინათლით ანათებს, იგი მზიდან გამოსხივებული სინათლის მხოლოდ 7%-ს ირეკლავს.\n" +
                    "\n" +
                    "პირველი ხელოვნური ობიექტი, რომელიც მთვარეზე დაეშვა იყო „ლუნა 2“ (1959). პირველი ფოტოსურათები მთვარის დედამიწისგან მოფარებულ მხარეს გადაიღო „ლუნა 3“-მა იმავე წელს. პირველი ადამიანები, რომლებმაც მთვარეზე დადგეს ფეხი იყვნენ ხომალდიდან „აპოლო 11“ (აშშ, 1969)."
        )
    )
    Planetlist.add(
        PlanetData(
            3,
            "Neptune",
            "Milkyway Galaxy",
            "ნეპტუნი სიშორით მერვე პლანეტაა მზიდან და ყველაზე შორეული გაზის გიგანტი ჩვენს მზის სისტემაში. ნეპტუნის ორბიტის ექსცენტრისიტეტის კოეფიციენტი 0.011214269 უდრის. მიუხედავად იმისა, რომ გაზის გიგანტთა შორის ყველაზე მცირეა, ნეპტუნი ურანზე უფრო მასიურია. მისი მასა დედამიწის 17 მასის ტოლია. ნეპტუნის ზედაპირის მინიმალური ტემპერატურა -218 °C (55 °K). ხოლო მაქსიმალური -196 °C (77 °K). მძლავრი გრავიტაციული ველის გამო მისმა შემადგენელმა გაზმა მაღალი სიმჭიდროვის კომპრესია განიცადა. ვარაუდობენ რომ მის ცენტრში ტემპერატურა 5000 °C. (5273 °K). ნეპტუნი სიდიდით მესამე პლანეტაა (დიამეტრით მეოთხე)\n" +
                    "\n" +
                    "ნეპტუნის ატმოსფერო შედგება 90 % წყალბადისგან, 19 % ჰელიუმისგან და 1 % სხვა აირებისგან. მისი ეკვატორული დიამეტრი 49 500 კმ-ია, ხოლო პოლარული დიამეტრი 48 700 კმ. ორბიტაზე მოძრაობის სიჩქარეა 5430 მ/წმ, ხოლო მზის ირგვლივ ერთ ბრუნს 164 წელს 9 თვეს და 15 დღეს ანდომებს. თავისი ღერძის გარშემო ბრუნვის პერიოდია: 16 სთ 6 წთ 36 წმ. აფელიუმში მანძილი 4 553 946 490 კმ-ს (30.44125206 ა. ე.) უდრის, პერიფელიუმში 4 452 940 833 კმ-ს (29.76607095 ა. ე.). საშუალო მანძილი 4 503 443 661 კმ-ია (30.10366151 ა. ე.).\n" +
                    "\n" +
                    "ბოლო დროს ოდნავ შესამჩნევი რუხი რგოლები იქნა შენიშნული ამ ლურჯი პლანეტის ირგვლივ, თუმცა ისინი სატურნისაზე ნაკლებად მასიურია. მათი აღმოჩენისას მიიჩნევდნენ, რომ ეს რგოლები არასრული იყო, მაგრამ ’’ვოიაჯერ-2’’-მა ეს ჰიპოთეზა უარყო. ნეპტუნს ასევე ახასიათებს 2.100 კმ/სთ სიჩქარის წყალბადის, ჰელიუმისა და მეთანის ქარები, რაც მას ლურჯ შეფერილობას აძლევს. ნეპტუნს 13 თანამგზავრი ჰყავს.მისი უდიდესი თანამგზავრი ტრიტონი გამოირჩევა რეტროგრადული ორბიტით, ექსტრემალურად ცივია -235 °C (38 °K) და მას ექსტრემალურად შეკუმშული (14 მიკრობარი) ნიგროგენ/მეთანის ატმოსფერო აქვს.\n" +
                    "\n" +
                    "პლანეტას რომაული ღმერთი ნეპტუნის სახელი ჰქვია მისი ლურჯი მეთანის ღრუბლების გამო. მისი ასტრონომიული სიმბოლო ღმერთის სამკაპის ნიშნის სტილიზებული ვერსიაა (♆).\n" +
                    "\n" +
                    "პლანეტა აღმოჩენილ იქნა 1846 წლის 23 სექტემბერს და დღემდე მას მხოლოდ ერთი ხომალდი ვოიაჯერ 2 ეწვია, რომელმაც მის გასწვრივ 1989 წლის 25 აგვისტოს ჩაიფრინა."
        )
    )
    Planetlist.add(
        PlanetData(
            4,
            "Earth",
            "Milkyway Galaxy",
            "დედამიწა მზის სისტემაში მზიდან მესამე პლანეტაა. იგი უდიდესია დედამიწის ტიპის პლანეტებს შორის და სამყაროში ცნობილი ერთადერთი ადგილია, რომელიც დასახლებულია ცოცხალი არსებებით. დედამიწის ზედაპირის უდიდესი ნაწილი წყალს უკავია, მის გარშემო კი ჰაერის გარსი - ატმოსფეროა. იგი დაახლოებით 4,3 მილიარდი წლის წინ წარმოიქმნა და მალევე შეიძინა თავისი ერთადერთი ბუნებრივი თანამგზავრი მთვარე. აგრეთვე დღემდე აღმოჩენილია რამდენიმე კვაზითანამგზავრი. დედამიწაზე ცხოვრობს გონიერი არსება — ადამიანი. 2015 წლის ბოლო მონაცემებით დედამიწაზე 7,6 მილიარდი ადამიანი ცხოვრობს."
        )
    )
    Planetlist.add(
        PlanetData(
            5,
            "Venus",
            "Milkyway Galaxy",
            "ვენერა მეორე პლანეტაა მზიდან და მას ხშირად დედამიწის დობილს უწოდებენ, ვინაიდან ორივე ციური სხეული ერთმანეთს საკმაოდ ემსგავსება სიდიდითა და შემადგენლობით. პლანეტას რომაელი სიყვარულის ქალღმერთის ვენერას სახელი ჰქვია.\n" +
                    "\n" +
                    "ვენერას ზედსართავი სახელი \"ვენერიულია\", თუმცა მისი ამგვარი ფორმით გამოყენებისგან თავს იკავებენ, ამ სიტყვის თანამედროვე ტერმინოლოგიაში სქესობრივი გზით გადამდებ დაავადებებთან ასოციაციის გამო. ამის ნაცვლად ზოგიერთი ასტრონომი იყენებს ზედსართავს \"სითერიული\", რომელიც მომდინარეობს \"სითერეა\"-დან, ძველ ბერძნულ მითოლოგიაში აფროდიტეს ალტერნატიული სახელი.\n" +
                    "\n" +
                    "ჩინურ, კორეულ, იაპონურ და ვიეტნამურ კულტურებში პლანეტას მოიხსენიებენ ლითონის ვარსკვლავად (金星), ხუთ ელემენტზე დაყრდნობით.\n" +
                    "\n" +
                    "ვენერა დედამიწას ყველა სხვა პლანეტაზე მეტად უახლოვდება ხოლმე. ეძახიან ”მწუხრის ვარსკვლავსაც”” და ”ცისკრის ვარსკვლავსაც””, რადგან მისი დანახვა ხან დაისის შემდეგ შეიძლება, ხან განთიადის წინ. იგი იმდენად ნათელი და კაშკაშაა, ხშირად ამოუცნობი მფრინავი ობიექტი (ამო, ”მფრინავი თეფში”) ჰგონიათ. ვენერას თეთრი ღრუბლების სქელი ფენა ფარავს. ზედაპირზე ტემპერატურა 470 ºC-ს აღწევს. მასზე ნაკლებადაა კოსმოსური სხეულის ნაკვალევი - კრატერები, რადგან კოსმოსური სხეულები უმეტესწილად ვენერას ატმოსფეროში შეჭრისთანავე იწვის მისი დიდი სიმკვრივის გამო. ზედაპირი დაფარულია ”ბებერი” ვულკანებითა და ლავით.\n" +
                    "\n" +
                    "ვენერას წელიწადი დედამიწის 7,5 თვის ტოლია. იგი თავისი ღერძის გარშემო პლანეტების უმეტესობასთან შედარებით პირუკუ ტრიალებს. მეცნიერები ამ მოვლენის მიზეზს დამაჯერებლად ვერ ხსნიან. ვენერას ღერძული ბრუნვა რეკორდულად ნელია - მისი პერიოდი დედამიწის 243 დღე-ღამეს უდრის. მზის ირგვლივ ორბიტაზე 35 020 მ/წმ სიჩქარით მოძრაობს. მისი დიამეტრი 12 104 კმ-ია. მზის ირგვლივ ერთ ბრუნს ასრულებს 7 თვესა და 12 დღეში. აფელიუმში მზიდან 108 942 109 კმ-ით (0.728 231 28 ა.ე.) არის დაშორებული, პერიფელიუმში 107 476 259 კმ-ია (0.718 432 70), საშუალო მანძილი არის 108 208 930 კმ (0.723 332). ვენერას ორბიტა თითქმის წრეა, ექსცენტრისიტეტი 0.0068 უდრის.\n" +
                    "\n" +
                    "მეცნიერები ვენერას დღესაც დიდი გულისყურით სწავლობენ. მის ზედაპირს სხვადასხვა დროს რამდენიმე კოსმოსური ავტომატური სადგური მიუახლოვდა. მათ დედამიწაზე პლანეტის შესახებ ინფორმაციები გადმოსცეს. პლანეტის სიმხურვალის გამო ეს სადგური მალე დაიწვა. ვენერას ატმოსფეროს ტემპერატურა 462 °C (735 °K). წნევა 93 ატმოსფერო (9,3 მპა). ატმოსფერო ძირითადად გოგირდმჟავის ორთქლისაგან შედგება. მის ზედაპირზე განუწყვეტლივ ქრის ქარი, რომლის სიჩქარე მერყეობს 270-დან 350 კილომეტრამდე საათში."
        )
    )
    Planetlist.add(
        PlanetData(
            6,
            "Uranus",
            "Milkyway Galaxy",
            "ურანი მზიდან მეშვიდე პლანეტაა დაშორების მიხედვით. ის რადიუსით მესამე, ხოლო მასით მეოთხეა მზის სისტემაში. ურანის შედგენილობა ნეპტუნისას ჰგავს, ხოლო ეს ორი პლანეტა გაზური გიგანტებისგან, იუპიტერისა და სატურნისგან განსხვავებულია, ამიტომაც ასტრონომები ურანსა და ნეპტუნს განცალკევებულ კატეგორიაში — „ყინულის გიგანტებში“ მოიხსენიებენ. მიუხედავად იმისა, რომ ურანის ატმოსფერო წყალბადისა და ჰელიუმის ძირითადი შედგენილობით სატურნსა და იუპიტერს წააგავს, ის შეიცავს უფრო მეტ „ყინულს“, როგორებიცაა ამიაკი და მეთანი, სხვა "
        )
    )
    Planetlist.add(
        PlanetData(
            7,
            "Sun",
            "Milkyway Galaxy",
            "მზე მზის სისტემის ცენტრში მდებარე ერთადერთი ვარსკვლავი. ის თითქმის იდეალურად სფერულია და შედგება ცხელი პლაზმისგან, რომელშიც ჩაქსოვილია მაგნიტური ველები. მზის დიამეტრი დაახლოებით 1 392 684 კილომეტრია — დედამიწის დიამეტრზე 109-ჯერ დიდი. მისი მასა (1.989×1030 კილოგრამი; დედამიწის მასას დაახლოებით 330 000-ჯერ აღემატება) მზის სისტემის მთლიანი მასის 99,86%-ს მოიცავს.[14] ქიმიურად, მზის მასის 3/4-ს წყალბადი შეადგენს, ხოლო დანარჩენი უმეტესად ჰელიუმია. დარჩენილი 1,69% (რომელიც დედამიწის მასას 5600-ჯერ აღემატება) მოიცავს მძიმე ელემენტებს, როგორებიცაა: ჟანგბადი, ნახშირბადი, ნეონი, რკინა და სხვა.[15]\n" +
                    "\n" +
                    "მზე 4,568 მილიარდი წლის წინ ჩამოყალიბდა დიდ მოლეკულურ ღრუბელში არსებულ რეგიონის გრავიტაციული კოლაფსით. მატერიის უმეტესობა ცენტრში მოგროვდა, ხოლო დანარჩენი გაბრტყელდა მბრუნავ დისკოდ, რომელიც შემდგომში მზის სისტემა გახდა. ცენტრალური მასა უფრო და უფრო ცხელი და მკვრივი გახდა, საბოლოოდ კი დაიწყო თერმობირთვული სინთეზი მის ბირთვში. მიჩნეულია, რომ თითქმის ყველა ვარსკვლავი ამ პროცესის შედეგად წარმოიქმნა. მზე სპექტრული კლასით არის G ტიპის მთავარი მიმდევრობის ვარსკვლავი (G2V) და მას არაფორმალურად ყვითელ ჯუჯად მოიხსენიებენ, რადგან მისი ხილული გამოსხივება სპექტრის ყვითელ-მწვანე ნაწილშია ყველაზე ინტენსიური. მიუხედავად იმისა, რომ სინამდვილეში იგი თეთრი ფერისაა, დედამიწის ზედაპირიდან ყვითელი ჩანს ატმოსფეროს მიერ ლურჯი სინათლის გაფანტვის გამო.[18] სპექტრული კლასის მიხედვით, G2 მიუთითებს ზედაპირის ტემპერატურას (დაახ. 5505°C) და V მიუთითებს, რომ მზე, სხვა ვარსკვლავების მსგავსად, მთავარი მიმდევრობის ვარსკვლავია და, აქედან გამომდინარე, ენერგიას წარმოქმნის წყალბადის ჰელიუმად სინთეზით. მზე თავის ბირთვში 620 მილიონი ტონა წყალბადის სინთეზს ახდენს წამში."
        )
    )
    Planetlist.add(
        PlanetData(
            8,
            "Saturn",
            "Milkyway Galaxy",
            "სატურნი სიშორით მეექვსე პლანეტაა მზიდან. ეს გაზის გიგანტი სიდიდით მეორე პლანეტაა მზის სისტემაში იუპიტერის შემდეგ. პლანეტას რომაული ღმერთი სატურნის სახელი ჰქვია. მისი სიმბოლოა ღმერთის კვერთხის სტილიზებული რეპრეზენტაცია - ♄. ჩინურ, კორეულ, იაპონურ და ვეიტნამურ კულტურებში პლანეტას მიწის ვარსკვლავად მოიხსენიებენ (土星), ხუთი ელემენტის ციკლის მიხედვით. სატურნს ადრე სანამ ტელესკოპს გამოიგონებდნენ ყურებიან პლანეტას ეძახდნენ, რადგან შორიდან მისი რგოლები ყურებს ჰგავდა.\n" +
                    "\n" +
                    "სატურნის პირველი ფოტოსურათი პიონერ 11 -მა 1979 წლის სექტემბერში გადაიღო 20 000 კმ-ის მანძილიდან. მაშინ აგრეთვე მისი რამდენიმე თანამგზავრი აღმოაჩინა და სურათები გადაუღო. ნასას 2016 წლის მონაცემებით სატურნს 82 თანამგზავრი ჰყავს,[8] მათ შორის ყველაზე დიდია ტიტანი. სატურნის ატმოსფეროს 96,3 % წყალბადისგან შედგება, 3,25 % ჰელიუმისგან, დანარჩენი 0,45 % სხვა აირებია.\n" +
                    "\n" +
                    "სატურნი აფელიუმში მზიდან 1 513 325 783 კმ-ზე (10.11595804 ა.ე.) იმყოფება, ხოლო პერიფელიუმში 1 353 572 956 კმ (9.04807635 ა.ე.). მზიდან საშუალო დაშორების მანძილია 1 433 449 370 კმ (9.58201720 ა. ე.). სიდერული ბრუნვის პერიოდია 10 სთ 34 წთ. ორბიტაზე მოძრაობის სიდერული პერიოდია 29 წელი 5 თვე 15 დღე. ორბიტის ექსცენტრისიტეტია 0.055723219. მისი ეკვატორული დიამეტრია 120 540 კმ, ხოლო პოლარული დიამეტრი 108 730 კმ. მზის ირგვლივ ორბიტაზე მოძრაობის სიჩქარეა 9690 მ/წმ. მისი მასა 95 დედამიწის მასის ტოლია. გარე ღრუბლების ფენის მაქსიმალური ტემპერატურაა -139 °C (134 °K), მინიმალური -190 °C (83 °K)."
        )
    )
    Planetlist.add(
        PlanetData(
            9,
            "Jupiter",
            "Milkyway Galaxy",
            "იუპიტერი მეხუთე პლანეტაა მზიდან დაშორებით და მზის სისტემის უდიდესი ციური სხეული. პლანეტა ცნობილია ანტიკური ხანიდან და სახელწოდება მომდინარეობს ძველი რომაული ღვთაება იუპიტერიდან, რომლის პატივსაცემადაც მიიღო ეს სახელწოდება. მიეკუთვნება გაზის გიგანტების ტიპის პლანეტას."
        )
    )
    Planetlist.add(
        PlanetData(
            10,
            "Mercury",
            "Milkyway Galaxy",
            "მერკური მზესთან ყველაზე ახლოს მდებარე პლანეტაა. ის ასევე ყველაზე პატარაა და მისი ორბიტა ყველაზე ექსცენტრიულია მთელ რვა პლანეტას შორის. მისი ორბიტალური პერიოდი 88 დღეს გრძელდება (დედამიწის დღე). როდესაც ორჯერ დაასრულებს ორბიტალურ პერიოდს, მერკური ღერძის გარშემო ორჯერ შემობრუნდება. პლანეტას რომაული ღმერთის - მერკურის სახელწოდება აქვს. მერკური ღმერთების შიკრიკი, მედიატორი იყო.\n" +
                    "\n" +
                    "მერკურის ზედაპირი ძალიან კრატერიანია და გარეგნობით დედამიწის მთვარეს ძალიან ჰგავს. ეს კი იმაზე მიუთითებს, რომ მერკური მილიარდობით წლების განმავლობაში გეოლოგიურად არააქტიური იყო. რადგანაც მერკურის თითქმის არ აქვს ატმოსფერო, რომ სითბო შეინარჩუნოს, მისი ზედაპირი ექსტრემალურ ტემპერატურულ ცვლილებებს იტანს - ღამით -173.15 °C და დღისით 426.85 °C. მერკურის ღერძი ყველა პლანეტის ღერძზე დახრილია, მაგრამ მისი ორბიტალური ექსცენტრისიტეტი უდიდესია. პლანეტაზე სეზონის ცვალებადობა უფრო დამოკიდებულია მისი მზიდან დაშორებაზე, ვიდრე პლანეტის ღერძის დახრილობაზე, რომელიც დედამიწაზე და სხვა პლანეტებზე სეზონის ცვალებადობის ძირითადი გამომწვევი მიზეზია. როდესაც მერკური პერიჰელიუმში იმყოფება, ის მზისგან 2-ჯერ მეტ სითბოს იღებს, ვიდრე აფელიუმში ყოფნისას. რადგანაც პლანეტის სეზონები დამოკიდებულია ორბიტალურ ექსცენტისიტეტზე და არა ღერძული დახრილობაზე, სეზონები ერთმანეთისგან არ განსხვავდებიან არც ერთ ნახევარსფეროზე, ანუ პლანეტის ყველა წერტილში ერთი სეზონია.\n" +
                    "\n" +
                    "მერკური და ვენერა დედამიწის ცაზე შესაძლებელია გამოჩნდნენ, როგორც დილის, ასევ საღამოს ვარსკვლავი (რადგან ისინი უფრო ახლოს არიან მზესთან, ვიდრე დედამიწა), თუმცა, ცაზე მერკურის მზესთან მიახლოება მის დანახვას უფრო რთულს ხდის, ვიდრე ვენერასია."
        )
    )
    return Planetlist
}
}
